InformationRegisters/омг_Предоплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_Предоплаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_СтатусыПредоплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>InvoiceId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроверок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TransactionId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежныйДокументВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвратУслуг</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистраторЗаписи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/омг_НастройкиTipTop.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_НастройкиTipTop</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_ИспользоватьПредоплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_КоличествоПроверокПредоплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/омг_ОстаткиПредоплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>омг_ОстаткиПредоплаты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/омг_ВидыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>омг_ВидыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предоплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоплата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/омг_СтатусыПредоплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>омг_СтатусыПредоплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПринята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизведенВозврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийОказанияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОказанияУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратКлиенту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/омг_Предоплата/Ext/Module.bsl
Функция ВернутьСтатусОплаты(Документ) Экспорт
	
	ВозврЗнач = "";	
	ТипДокумента = "";
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.Заявка") Тогда
		ТипДокумента = Символы.ПС + " омг_Предоплаты.Заявка = &Документ" + Символы.ПС
	Иначе
		ТипДокумента = Символы.ПС + " омг_Предоплаты.ПлатежныйДокумент = &Документ" + Символы.ПС
	КонецЕсли;   
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	омг_Предоплаты.Статус КАК Статус,
	|	омг_Предоплаты.Ссылка КАК Ссылка,
	|	омг_Предоплаты.ПлатежныйДокумент КАК ПлатежныйДокумент
	|ИЗ
	|	РегистрСведений.омг_Предоплаты КАК омг_Предоплаты
	|
	|ГДЕ " + ТипДокумента+ 
	"
	|УПОРЯДОЧИТЬ ПО
	|	омг_Предоплаты.РегистраторЗаписи.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать();
	//ВыборкаДетальныеЗаписи2 = РезультатЗапроса[1].Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ВозврЗнач = ВыборкаДетальныеЗаписи;
		Возврат ВозврЗнач;
	КонецЕсли;
	
	Возврат ВозврЗнач;
	
КонецФункции	

Процедура омг_ПринятьПредоплату(Источник,ИсточникОснование = Неопределено) Экспорт   
	
	ИсточникОБъект = Источник.Ссылка.ПолучитьОбъект();
	
	Если не ИсточникОБъект.ПометкаУдаления и ИсточникОБъект.омг_ВидОплаты = Перечисления.омг_ВидыОплаты.Предоплата Тогда   
		
		Если ПолучитьСтатусПредоплаты(ИсточникОБъект.Ссылка) = Неопределено Тогда
			
			ГУиД = СокрЛП(ИсточникОБъект.Ссылка.УникальныйИдентификатор());
			СсылкаНаОплату = "Оплата принята через кассу";
			Менеджер = РегистрыСведений.омг_Предоплаты.СоздатьМенеджерЗаписи();
			Менеджер.РегистраторЗаписи = ИсточникОБъект.Ссылка;
			Менеджер.Заявка = ИсточникОБъект.ДокументОснование.Ссылка;		
			Менеджер.Сумма = ИсточникОБъект.СуммаДокумента; 
			Менеджер.ПлатежныйДокумент = ИсточникОБъект.Ссылка; 
			Менеджер.InvoiceId         = ГУиД;
			ЗаявкаОбъект = ИсточникОБъект.ДокументОснование.Ссылка.ПолучитьОбъект();
			Если ТипЗнч(ИсточникОБъект) = Тип("ДокументОбъект.ОплатаПлатежнойКартой") Тогда
				СсылкаНаОплату = ПолучитьСсылкаНаПредоплату(ИсточникОБъект.СуммаДокумента,ГУиД);
				Менеджер.Статус = Перечисления.омг_СтатусыПредоплаты.ОжиданиеОплаты; 
				Если не ЗаявкаОбъект.Состояние = Справочники.ВидыСостоянийЗаявок.Забронирована Тогда
					ЗаявкаОбъект.Состояние = Справочники.ВидыСостоянийЗаявок.Забронирована;
					ЗаявкаОбъект.Записать();
				КонецЕсли;	
			иначе
				Менеджер.Статус = Перечисления.омг_СтатусыПредоплаты.ОплатаПринята; 
				Если не ЗаявкаОбъект.Состояние = Справочники.ВидыСостоянийЗаявок.Запланирована Тогда
					ЗаявкаОбъект.Состояние = Справочники.ВидыСостоянийЗаявок.Запланирована;
					ЗаявкаОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
			Менеджер.Ссылка = СсылкаНаОплату;
			Менеджер.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

Функция ПолучитьСтатусПредоплаты(Источник) Экспорт
	
	ВозЗначение = Неопределено;
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.Заявка") Тогда
		
		Условия = " омг_Предоплаты.Заявка = &Заявка "; 
		Запрос.УстановитьПараметр("Заявка",Источник); 
		
	Иначе
		
		Условия = " омг_Предоплаты.ПлатежныйДокумент = &ПлатежныйДокумент ";
		Запрос.УстановитьПараметр("ПлатежныйДокумент",Источник); 
		
	КонецЕсли;	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	омг_Предоплаты.Заявка КАК Заявка,
	|	омг_Предоплаты.Сумма КАК Сумма,
	|	омг_Предоплаты.Статус КАК Статус,
	|	омг_Предоплаты.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|	омг_Предоплаты.InvoiceId КАК InvoiceId
	|ИЗ
	|	РегистрСведений.омг_Предоплаты КАК омг_Предоплаты
	|ГДЕ" + Условия;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ВозЗначение = ВыборкаДетальныеЗаписи
	КонецЕсли;
	
	Возврат ВозЗначение;
	
КонецФункции  

Функция ПолучитьСсылкаНаПредоплату(Сумма,ГУИД) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозЗначение = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	омг_НастройкиTipTop.Логин КАК Логин,
	|	омг_НастройкиTipTop.Пароль КАК Пароль
	|ИЗ
	|	РегистрСведений.омг_НастройкиTipTop КАК омг_НастройкиTipTop";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Логин = ВыборкаДетальныеЗаписи.Логин;
		Пароль = ВыборкаДетальныеЗаписи.Пароль;
		
		СоединениеHTTP = Новый HTTPСоединение("api.tiptoppay.kz",,Логин,Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(),);
		СтрукnураОтправки = Новый Структура("Amount,Currency,Description,RequireConfirmation,SendEmail,InvoiceId",Сумма,"KZT","Предоплата за мед.услуги",false,false,ГУИД);
		
		ЗаписьJSON = Новый ЗаписьJSON;               
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтрукnураОтправки);
		СтрокаДляТела = ЗаписьJSON.Закрыть();
		
		ЗаголовокЗапросаHTTP = Новый Соответствие();
		ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
		
		ЗапросHTTP = Новый HTTPЗапрос("/orders/create",ЗаголовокЗапросаHTTP); 
		ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаДляТела);
		Ответ = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
		
		Если Ответ.КодСостояния = 200 Тогда
			
			Сообщение = Ответ.ПолучитьТелоКакСтроку("UTF-8");
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Сообщение);
			ДанныеВозврата = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			ВозЗначение = ДанныеВозврата.Model.Url;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат ВозЗначение;
	
КонецФункции    

Функция ОбновитьСтатусПредоплатыНаСервере(Сумма,ГУИД) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозЗначение = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	омг_НастройкиTipTop.Логин КАК Логин,
	|	омг_НастройкиTipTop.Пароль КАК Пароль
	|ИЗ
	|	РегистрСведений.омг_НастройкиTipTop КАК омг_НастройкиTipTop";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Логин = ВыборкаДетальныеЗаписи.Логин;
		Пароль = ВыборкаДетальныеЗаписи.Пароль;
		
		СоединениеHTTP = Новый HTTPСоединение("api.tiptoppay.kz",,Логин,Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(),);
		СтрукnураОтправки = Новый Структура("Amount,Currency,Description,RequireConfirmation,SendEmail,InvoiceId",Формат(Сумма,"ЧДЦ=1; ЧРД=."),"KZT","Предоплата за мед.услуги",false,false,ГУИД);
		
		ЗаписьJSON = Новый ЗаписьJSON;               
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтрукnураОтправки);
		СтрокаДляТела = ЗаписьJSON.Закрыть();
		
		ЗаголовокЗапросаHTTP = Новый Соответствие();
		ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
		
		ЗапросHTTP = Новый HTTPЗапрос("/orders/create",ЗаголовокЗапросаHTTP); 
		ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаДляТела);
		Ответ = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
		
		Если Ответ.КодСостояния = 200 Тогда
			
			Сообщение = Ответ.ПолучитьТелоКакСтроку("UTF-8");
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Сообщение);
			ДанныеВозврата = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			ВозЗначение = ДанныеВозврата.Model.Url;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат ВозЗначение;
	
КонецФункции  

Процедура омг_ОбновитьСтатусыПредоплат() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);       
		 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_Предоплаты.Заявка КАК Заявка,
		|	омг_Предоплаты.ПлатежныйДокумент КАК ПлатежныйДокумент,
		|	омг_Предоплаты.InvoiceId КАК InvoiceId,
		|	омг_Предоплаты.Заявка.Филиал.Организация КАК ЗаявкаФилиалОрганизация,
		|	омг_Предоплаты.Заявка.Дата КАК ЗаявкаДата,
		|	омг_НастройкиTipTop.Логин КАК Логин,
		|	омг_НастройкиTipTop.Пароль КАК Пароль,
		|	омг_НастройкиTipTop.омг_КоличествоПроверокПредоплаты КАК КоличествоПроверок
		|ИЗ
		|	РегистрСведений.омг_Предоплаты КАК омг_Предоплаты
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.омг_НастройкиTipTop КАК омг_НастройкиTipTop
		|		ПО омг_Предоплаты.Заявка.Филиал.Организация = омг_НастройкиTipTop.Организация
		|ГДЕ
		|	омг_Предоплаты.КоличествоПроверок < омг_НастройкиTipTop.омг_КоличествоПроверокПредоплаты
		|	И омг_Предоплаты.Статус = ЗНАЧЕНИЕ(Перечисление.омг_СтатусыПредоплаты.ОжиданиеОплаты)
		|	И омг_НастройкиTipTop.омг_ИспользоватьПредоплату
		|	И НЕ омг_Предоплаты.TransactionId = """"
		|
		|СГРУППИРОВАТЬ ПО
		|	омг_Предоплаты.InvoiceId,
		|	омг_Предоплаты.ПлатежныйДокумент,
		|	омг_Предоплаты.Заявка,
		|	омг_НастройкиTipTop.Пароль,
		|	омг_НастройкиTipTop.Логин,
		|	омг_Предоплаты.Заявка.Филиал.Организация,
		|	омг_Предоплаты.Заявка.Дата,
		|	омг_НастройкиTipTop.омг_КоличествоПроверокПредоплаты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаявкаФилиалОрганизация,
		|	ЗаявкаДата
		|ИТОГИ ПО
		|	ЗаявкаФилиалОрганизация";
			
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаЗаявкаФилиалОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЗаявкаФилиалОрганизация.Следующий() Цикл
			
			ВыборкаДетальныеЗаписи = ВыборкаЗаявкаФилиалОрганизация.Выбрать();  
			
			СЧ = Истина;   
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если СЧ Тогда
					
					Логин = ВыборкаДетальныеЗаписи.Логин;
					Пароль = ВыборкаДетальныеЗаписи.Пароль;	
					СоединениеHTTP = Новый HTTPСоединение("api.tiptoppay.kz",,Логин,Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(),);
					ЗаголовокЗапросаHTTP = Новый Соответствие();
					ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
					ЗапросHTTP = Новый HTTPЗапрос("/v2/payments/find",ЗаголовокЗапросаHTTP); 
					СЧ = Ложь;
					
				КонецЕсли;  
				
				СтрукnураОтправки = Новый Структура("InvoiceId",ВыборкаДетальныеЗаписи.InvoiceId);
				
				ЗаписьJSON = Новый ЗаписьJSON;               
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON, СтрукnураОтправки);
				СтрокаДляТела = ЗаписьJSON.Закрыть();
				
				ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаДляТела);
				Ответ = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
				
				Если Ответ.КодСостояния = 200 Тогда
					
					Сообщение = Ответ.ПолучитьТелоКакСтроку("UTF-8");
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(Сообщение);
					ДанныеВозврата = ПрочитатьJSON(ЧтениеJSON);
					ЧтениеJSON.Закрыть();
					TransactionId = "";
					Если ДанныеВозврата.Message = "Not found" Тогда
						Статус = Перечисления.омг_СтатусыПредоплаты.ОжиданиеОплаты
					Иначе 
						Если ДанныеВозврата.Model.Status = "Completed" Тогда
							Статус = Перечисления.омг_СтатусыПредоплаты.ОплатаПринята;
							TransactionId = ДанныеВозврата.Model.TransactionId;
						иначе
							Статус = Перечисления.омг_СтатусыПредоплаты.НетОплаты 
						КонецЕсли; 
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.InvoiceId) и ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Заявка) Тогда
						омг_ОбновитьСтатусыПредоплатВРегистре(ВыборкаДетальныеЗаписи.Заявка, Статус, ВыборкаДетальныеЗаписи.КоличествоПроверок,TransactionId,ВыборкаДетальныеЗаписи.ПлатежныйДокумент)
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЦикла;
		
КонецПроцедуры

Процедура омг_ОбновитьСтатусыПредоплатВРегистре(Заявка, Статус, КоличествоПроверок,TransactionId,ПлатежныйДокумент)
	
	УстановитьПривилегированныйРежим(Истина); 
	Запись = РегистрыСведений.омг_Предоплаты.СоздатьМенеджерЗаписи();
	Запись.Заявка = Заявка;
	Запись.РегистраторЗаписи = ПлатежныйДокумент;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Статус = Статус;
		Запись.TransactionId = TransactionId;
		Запись.КоличествоПроверок = Запись.КоличествоПроверок + 1;
		Если Запись.КоличествоПроверок >= КоличествоПроверок и Запись.Статус = Перечисления.омг_СтатусыПредоплаты.ОжиданиеОплаты Тогда
			Запись.Статус = Перечисления.омг_СтатусыПредоплаты.НетОплаты;
			
			ЗаявкаОбъект = Заявка.Ссылка.ПолучитьОбъект();
			Если не ЗаявкаОбъект.Состояние = Справочники.ВидыСостоянийЗаявок.Отменена Тогда
				ЗаявкаОбъект.Состояние = Справочники.ВидыСостоянийЗаявок.Отменена;
				ЗаявкаОбъект.Записать();
			КонецЕсли;

		КонецЕсли;	
		Запись.Записать(); 
		Если Статус = Перечисления.омг_СтатусыПредоплаты.ОплатаПринята Тогда
			ПлатежныйДокументОбъект = ПлатежныйДокумент.ПолучитьОбъект();
			Если ПлатежныйДокументОбъект.Проведен Тогда
				ПлатежныйДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли; 
			
			ЗаявкаОбъект = Заявка.Ссылка.ПолучитьОбъект();
			Если не ЗаявкаОбъект.Состояние = Справочники.ВидыСостоянийЗаявок.Запланирована Тогда
				ЗаявкаОбъект.Состояние = Справочники.ВидыСостоянийЗаявок.Запланирована;
				ЗаявкаОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры     

Процедура омг_СделатьВозвратПредоплаты(Знач ДокументОснование, Знач Объект) Экспорт
	
	Если ВернутьСтатусОплаты(ДокументОснование).Статус = Перечисления.омг_СтатусыПредоплаты.ОплатаПринята Тогда  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_Предоплаты.Заявка КАК Заявка,
		|	омг_Предоплаты.ПлатежныйДокумент КАК ПлатежныйДокумент,
		|	омг_Предоплаты.InvoiceId КАК InvoiceId,
		|	омг_Предоплаты.Заявка.Филиал.Организация КАК ЗаявкаФилиалОрганизация,
		|	омг_Предоплаты.Заявка.Дата КАК ЗаявкаДата,
		|	омг_НастройкиTipTop.Логин КАК Логин,
		|	омг_НастройкиTipTop.Пароль КАК Пароль,
		|	омг_Предоплаты.Сумма КАК Сумма,
		|	омг_Предоплаты.TransactionId КАК TransactionId
		|ИЗ
		|	РегистрСведений.омг_Предоплаты КАК омг_Предоплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.омг_НастройкиTipTop КАК омг_НастройкиTipTop
		|		ПО омг_Предоплаты.Заявка.Филиал.Организация = омг_НастройкиTipTop.Организация
		|ГДЕ
		|	омг_Предоплаты.ПлатежныйДокумент = &ПлатежныйДокумент
		|	И омг_Предоплаты.Статус = ЗНАЧЕНИЕ(Перечисление.омг_СтатусыПредоплаты.ОплатаПринята)
		|
		|СГРУППИРОВАТЬ ПО
		|	омг_Предоплаты.InvoiceId,
		|	омг_Предоплаты.ПлатежныйДокумент,
		|	омг_Предоплаты.Заявка,
		|	омг_НастройкиTipTop.Пароль,
		|	омг_НастройкиTipTop.Логин,
		|	омг_Предоплаты.Заявка.Филиал.Организация,
		|	омг_Предоплаты.Заявка.Дата,
		|	омг_Предоплаты.Сумма,
		|	омг_Предоплаты.TransactionId
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаявкаФилиалОрганизация,
		|	ЗаявкаДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОказаниеУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрНакопления.омг_ОстаткиПредоплаты.Обороты(, , Регистратор, ) КАК омг_ОстаткиПредоплатыОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг КАК ОказаниеУслуг
		|		ПО омг_ОстаткиПредоплатыОбороты.Регистратор = ОказаниеУслуг.ДокументОснование
		|ГДЕ
		|	омг_ОстаткиПредоплатыОбороты.ДокументПоступления = &ПлатежныйДокумент
		|	И ОказаниеУслуг.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту)
		|	И ОказаниеУслуг.Проведен";
		
		Запрос.УстановитьПараметр("ПлатежныйДокумент", ДокументОснование);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать();
		ВыборкаДетальныеОказание = РезультатЗапроса[1].Выбрать();  
		
		ОказаниеВозврат = Документы.ОказаниеУслуг.ПустаяСсылка();
		
		Если ВыборкаДетальныеОказание.Следующий() Тогда
			
			ОказаниеВозврат =  ВыборкаДетальныеОказание.Ссылка
			
		КонецЕсли;	

		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда 
				
				Набор = РегистрыСведений.омг_Предоплаты.СоздатьНаборЗаписей();
				Набор.Отбор.Заявка.Установить(ДокументОснование.ДокументОснование);
				Набор.Отбор.РегистраторЗаписи.Установить(Объект.Ссылка);
				Запись = Набор.Добавить(); 
				Запись.Заявка = ДокументОснование.ДокументОснование;
				Запись.РегистраторЗаписи = Объект.Ссылка;
				Запись.Сумма = ВыборкаДетальныеЗаписи.Сумма;  
				Запись.Статус = Перечисления.омг_СтатусыПредоплаты.ПроизведенВозврат;
				Запись.ПлатежныйДокумент = Объект.ДокументОснование.Ссылка;
				Запись.ПлатежныйДокументВозврата = Объект.Ссылка;
				Запись.ВозвратУслуг = ОказаниеВозврат;
				ГУИД = Объект.Ссылка.УникальныйИдентификатор();
				ГУИДСтрокой = СокрЛП(ГУИД);
				Запись.InvoiceId = ГУИДСтрокой;
				Запись.TransactionId ="";
				Запись.Ссылка = "";
				Набор.Записать();
				
				
			иначе	
				Логин = ВыборкаДетальныеЗаписи.Логин;
				Пароль = ВыборкаДетальныеЗаписи.Пароль;	
				СоединениеHTTP = Новый HTTPСоединение("api.tiptoppay.kz",,Логин,Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(),);
				ЗаголовокЗапросаHTTP = Новый Соответствие();
				ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
				ЗапросHTTP = Новый HTTPЗапрос("/payments/refund",ЗаголовокЗапросаHTTP); 
				
				СтрукnураОтправки = Новый Структура("TransactionId,Amount",ВыборкаДетальныеЗаписи.TransactionId,ВыборкаДетальныеЗаписи.Сумма);
				
				ЗаписьJSON = Новый ЗаписьJSON;               
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON, СтрукnураОтправки);
				СтрокаДляТела = ЗаписьJSON.Закрыть();
				
				ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаДляТела);
				Ответ = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
				
				Если Ответ.КодСостояния = 200 Тогда
					
					Сообщение = Ответ.ПолучитьТелоКакСтроку("UTF-8");
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(Сообщение);
					ДанныеВозврата = ПрочитатьJSON(ЧтениеJSON);
					ЧтениеJSON.Закрыть(); 
					
					Если не ДанныеВозврата.Message = "Not found" и ДанныеВозврата.Success Тогда
						
						Набор = РегистрыСведений.омг_Предоплаты.СоздатьНаборЗаписей();
						Набор.Отбор.Заявка.Установить(ДокументОснование.ДокументОснование);
						Набор.Отбор.РегистраторЗаписи.Установить(Объект.Ссылка);
						Запись = Набор.Добавить(); 
						Запись.Заявка = ДокументОснование.ДокументОснование;
						Запись.РегистраторЗаписи = Объект.Ссылка;
						Запись.Сумма = ВыборкаДетальныеЗаписи.Сумма;  
						Запись.Статус = Перечисления.омг_СтатусыПредоплаты.ПроизведенВозврат;
						Запись.ПлатежныйДокумент = Объект.ДокументОснование.Ссылка;
						Запись.ПлатежныйДокументВозврата = Объект.Ссылка;
						Запись.ВозвратУслуг = ОказаниеВозврат;
						ГУИД = Объект.Ссылка.УникальныйИдентификатор();
						ГУИДСтрокой = СокрЛП(ГУИД);
						Запись.InvoiceId = ГУИДСтрокой;
						Запись.TransactionId = ДанныеВозврата.Model.TransactionId;
						Запись.Ссылка = "";
						Набор.Записать();
						
						//Запись = РегистрыСведений.омг_Предоплаты.СоздатьМенеджерЗаписи();
						//Запись.Заявка = ДокументОснование.ДокументОснование;
						//Запись.Статус = Перечисления.омг_СтатусыПредоплаты.ПроизведенВозврат;
						//Запись.Прочитать();
						//Если Запись.Выбран() Тогда
						//	Запись.Статус = Перечисления.омг_СтатусыПредоплаты.ПроизведенВозврат;
						//	Запись.Записать();
						//	ПлатежныйДокументОбъект = ВыборкаДетальныеЗаписи.ПлатежныйДокумент.ПолучитьОбъект();
						//	Если ПлатежныйДокументОбъект.Проведен Тогда
						//ПлатежныйДокументОбъект.Записать();
						//    КонецЕсли;	
						//КонецЕсли;	
						
					КонецЕсли;	
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЕсли; 
		
	КонецЕсли;
			
КонецПроцедуры 	

Функция омг_ИспользуетсяПредоплата(Организация) Экспорт
		
	ВозЗначение = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_НастройкиTipTop.омг_ИспользоватьПредоплату КАК омг_ИспользоватьПредоплату
		|ИЗ
		|	РегистрСведений.омг_НастройкиTipTop КАК омг_НастройкиTipTop
		|ГДЕ
		|	омг_НастройкиTipTop.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ВозЗначение = ВыборкаДетальныеЗаписи.омг_ИспользоватьПредоплату
	КонецЕсли;	
	
	Возврат ВозЗначение;	
	
КонецФункции	
	
Функция ВернутьСуммуПредоплаты(Клиент,Регистратор,Период)Экспорт
	
	ВозЗначение = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(омг_ОстаткиПредоплатыОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	омг_ОстаткиПредоплатыОстатки.ДокументПоступления КАК ДокументПоступления
	|ИЗ
	|	РегистрНакопления.омг_ОстаткиПредоплаты.Остатки(&Период, Клиент = &Клиент) КАК омг_ОстаткиПредоплатыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	омг_ОстаткиПредоплатыОстатки.ДокументПоступления
	|
	|УПОРЯДОЧИТЬ ПО
	|	омг_ОстаткиПредоплатыОстатки.ДокументПоступления.Дата";
	
	Запрос.УстановитьПараметр("Клиент", Клиент); 
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
    Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();	
	
КонецФункции	

Функция ВернутьСуммуПредоплатыПоДокументу(Регистратор)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(омг_Предоплаты.Сумма) КАК Сумма
		|ИЗ
		|	РегистрСведений.омг_Предоплаты КАК омг_Предоплаты
		|ГДЕ
		|	омг_Предоплаты.ПлатежныйДокумент = &ПлатежныйДокумент
		|	И омг_Предоплаты.Статус = ЗНАЧЕНИЕ(Перечисление.омг_СтатусыПредоплаты.ОплатаПринята)";
	
	Запрос.УстановитьПараметр("ПлатежныйДокумент", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий(); 
	
	ВозЗначение = ?(ВыборкаДетальныеЗаписи.Сумма = NULL,0,ВыборкаДетальныеЗаписи.Сумма);	
		
	Возврат ВозЗначение;
	
КонецФункции	

Процедура омг_ОбновитьСтатусПредоплатПоЗапросу(Заявка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);       
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	омг_Предоплаты.Заявка КАК Заявка,
	|	омг_Предоплаты.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|	омг_Предоплаты.InvoiceId КАК InvoiceId,
	|	омг_Предоплаты.Заявка.Филиал.Организация КАК ЗаявкаФилиалОрганизация,
	|	омг_Предоплаты.Заявка.Дата КАК ЗаявкаДата,
	|	омг_НастройкиTipTop.Логин КАК Логин,
	|	омг_НастройкиTipTop.Пароль КАК Пароль,
	|	омг_НастройкиTipTop.омг_КоличествоПроверокПредоплаты КАК КоличествоПроверок
	|ИЗ
	|	РегистрСведений.омг_Предоплаты КАК омг_Предоплаты
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.омг_НастройкиTipTop КАК омг_НастройкиTipTop
	|		ПО омг_Предоплаты.Заявка.Филиал.Организация = омг_НастройкиTipTop.Организация
	|ГДЕ
	|	омг_Предоплаты.Заявка = &Заявка
	|
	|СГРУППИРОВАТЬ ПО
	|	омг_Предоплаты.InvoiceId,
	|	омг_Предоплаты.ПлатежныйДокумент,
	|	омг_Предоплаты.Заявка,
	|	омг_НастройкиTipTop.Пароль,
	|	омг_НастройкиTipTop.Логин,
	|	омг_Предоплаты.Заявка.Филиал.Организация,
	|	омг_Предоплаты.Заявка.Дата,
	|	омг_НастройкиTipTop.омг_КоличествоПроверокПредоплаты";
	
	Запрос.УстановитьПараметр("Заявка",Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Логин = ВыборкаДетальныеЗаписи.Логин;
		Пароль = ВыборкаДетальныеЗаписи.Пароль;	
		СоединениеHTTP = Новый HTTPСоединение("api.tiptoppay.kz",,Логин,Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(),);
		ЗаголовокЗапросаHTTP = Новый Соответствие();
		ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
		ЗапросHTTP = Новый HTTPЗапрос("/v2/payments/find",ЗаголовокЗапросаHTTP); 
		
		
		СтрукnураОтправки = Новый Структура("InvoiceId",ВыборкаДетальныеЗаписи.InvoiceId);
		
		ЗаписьJSON = Новый ЗаписьJSON;               
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтрукnураОтправки);
		СтрокаДляТела = ЗаписьJSON.Закрыть();
		
		ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаДляТела);
		Ответ = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
		
		Если Ответ.КодСостояния = 200 Тогда
			
			Сообщение = Ответ.ПолучитьТелоКакСтроку("UTF-8");
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Сообщение);
			ДанныеВозврата = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			TransactionId = "";
			Если ДанныеВозврата.Message = "Not found" Тогда
				Статус = Перечисления.омг_СтатусыПредоплаты.ОжиданиеОплаты
			Иначе 
				Если ДанныеВозврата.Model.Status = "Completed" Тогда
					Статус = Перечисления.омг_СтатусыПредоплаты.ОплатаПринята;
					TransactionId = ДанныеВозврата.Model.TransactionId;
				иначе
					Статус = Перечисления.омг_СтатусыПредоплаты.НетОплаты 
				КонецЕсли; 
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.InvoiceId) и ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Заявка) Тогда
				омг_ОбновитьСтатусыПредоплатВРегистре(ВыборкаДетальныеЗаписи.Заявка, Статус, ВыборкаДетальныеЗаписи.КоличествоПроверок,TransactionId,ВыборкаДетальныеЗаписи.ПлатежныйДокумент)
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
		
КонецПроцедуры

Процедура омг_ПриПроведениеОплатаПлатежнойКартой(Источник, Отказ, РежимПроведения) Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры
